# SQL questions - regression

(Use sub-queries or views, wherever necessary)

1. Create a database called `house_price_regression`.

In [10]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import getpass  # To get the password without showing the input

In [11]:
%load_ext sql

The sql extension is already loaded. To reload it, use:
  %reload_ext sql

In [27]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/bank'
%sql {connection_string}

 ········

In [13]:
%%sql
create database house_price_regression;
use house_price_regression;

 * mysql+pymysql://root:***@localhost/bank
(pymysql.err.ProgrammingError) (1007, "Can't create database 'house_price_regression'; database exists")
[SQL: create database house_price_regression;]
(Background on this error at: https://sqlalche.me/e/14/f405)

In [14]:
connection_string = 'mysql+pymysql://root:' + password + '@localhost/house_price_regression' + '?local_infile=1'

In [15]:
engine = create_engine(connection_string)

Si la siguiente linea da error abrir regression_data.xls con el Excel y guardarlo como regression_data.xlsx

In [16]:
df = pd.read_excel('regression_data.xls')

In [17]:
df.to_sql('house_price_data', con=engine, index=False, if_exists='replace')

21597

In [18]:
df.shape

(21597, 21)

2. Create a table `house_price_data` with the same columns as given in the csv file. Please make sure you use the correct data types for the columns. You can find the names of the headers for the table in the `regression_data.xls` file. Use the same column names as the names in the excel file. Please make sure you use the correct data types for each of the columns.

3. Import the data from the csv file into the table. Before you import the data into the empty table, make sure that you have deleted the headers from the csv file. (in this case, we have already deleted the header names from the csv files).  To not modify the original data, if you want you can create a copy of the csv file as well. Note you might have to use the following queries to give permission to SQL to import data from csv files in bulk:

    ```sql
    SHOW VARIABLES LIKE 'local_infile'; -- This query would show you the status of the variable ‘local_infile’. If it is off, use the next command, otherwise you should be good to go

    SET GLOBAL local_infile = 1;
    ```

In [29]:
password = getpass.getpass()
connection_string = 'mysql+pymysql://root:' + password + '@localhost/house_price_regression'
%sql {connection_string}

 ········

4.  Select all the data from table `house_price_data` to check if the data was imported correctly.

In [31]:
%%sql
select * from house_price_data limit 5;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
5 rows affected.

[(7129300520, datetime.datetime(2014, 10, 13, 0, 0), 3, 1.0, 1180, 5650, 1.0, 0, 0, 3, 7, 1180, 0, 1955, 0, 98178, 47.5112, -122.257, 1340, 5650, 221900),
 (6414100192, datetime.datetime(2014, 12, 9, 0, 0), 3, 2.25, 2570, 7242, 2.0, 0, 0, 3, 7, 2170, 400, 1951, 1991, 98125, 47.721, -122.319, 1690, 7639, 538000),
 (5631500400, datetime.datetime(2015, 2, 25, 0, 0), 2, 1.0, 770, 10000, 1.0, 0, 0, 3, 6, 770, 0, 1933, 0, 98028, 47.7379, -122.233, 2720, 8062, 180000),
 (2487200875, datetime.datetime(2014, 12, 9, 0, 0), 4, 3.0, 1960, 5000, 1.0, 0, 0, 5, 7, 1050, 910, 1965, 0, 98136, 47.5208, -122.393, 1360, 5000, 604000),
 (1954400510, datetime.datetime(2015, 2, 18, 0, 0), 3, 2.0, 1680, 8080, 1.0, 0, 0, 3, 8, 1680, 0, 1987, 0, 98074, 47.6168, -122.045, 1800, 7503, 510000)]

5.  Use the alter table command to drop the column `date` from the database, as we would not use it in the analysis with SQL. Select all the data from the table to verify if the command worked. Limit your returned results to 10.

In [32]:
%%sql
ALTER TABLE house_price_data
DROP COLUMN date;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
0 rows affected.

[]

In [34]:
%%sql
select * from house_price_data limit 10;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
10 rows affected.

[(7129300520, 3, 1.0, 1180, 5650, 1.0, 0, 0, 3, 7, 1180, 0, 1955, 0, 98178, 47.5112, -122.257, 1340, 5650, 221900),
 (6414100192, 3, 2.25, 2570, 7242, 2.0, 0, 0, 3, 7, 2170, 400, 1951, 1991, 98125, 47.721, -122.319, 1690, 7639, 538000),
 (5631500400, 2, 1.0, 770, 10000, 1.0, 0, 0, 3, 6, 770, 0, 1933, 0, 98028, 47.7379, -122.233, 2720, 8062, 180000),
 (2487200875, 4, 3.0, 1960, 5000, 1.0, 0, 0, 5, 7, 1050, 910, 1965, 0, 98136, 47.5208, -122.393, 1360, 5000, 604000),
 (1954400510, 3, 2.0, 1680, 8080, 1.0, 0, 0, 3, 8, 1680, 0, 1987, 0, 98074, 47.6168, -122.045, 1800, 7503, 510000),
 (7237550310, 4, 4.5, 5420, 101930, 1.0, 0, 0, 3, 11, 3890, 1530, 2001, 0, 98053, 47.6561, -122.005, 4760, 101930, 1230000),
 (1321400060, 3, 2.25, 1715, 6819, 2.0, 0, 0, 3, 7, 1715, 0, 1995, 0, 98003, 47.3097, -122.327, 2238, 6819, 257500),
 (2008000270, 3, 1.5, 1060, 9711, 1.0, 0, 0, 3, 7, 1060, 0, 1963, 0, 98198, 47.4095, -122.315, 1650, 9711, 291850),
 (2414600126, 3, 1.0, 1780, 7470, 1.0, 0, 0, 3, 7, 1050, 730, 1960, 0, 98146, 47.5123, -122.337, 1780, 8113, 229500),
 (3793500160, 3, 2.5, 1890, 6560, 2.0, 0, 0, 3, 7, 1890, 0, 2003, 0, 98038, 47.3684, -122.031, 2390, 7570, 323000)]

6.  Use sql query to find how many rows of data you have.

In [36]:
%%sql
select count(*) from house_price_data;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
1 rows affected.

[(21597,)]

7.  Now we will try to find the unique values in some of the categorical columns:

    - What are the unique values in the column `bedrooms`?
    - What are the unique values in the column `bathrooms`?
    - What are the unique values in the column `floors`?
    - What are the unique values in the column `condition`?
    - What are the unique values in the column `grade`?

In [41]:
%%sql
select distinct bedrooms from house_price_data;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
12 rows affected.

[(3,), (2,), (4,), (5,), (1,), (6,), (7,), (8,), (9,), (11,), (10,), (33,)]

In [42]:
%%sql
select distinct bathrooms from house_price_data;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
29 rows affected.

[(1.0,),
 (2.25,),
 (3.0,),
 (2.0,),
 (4.5,),
 (1.5,),
 (2.5,),
 (1.75,),
 (2.75,),
 (3.25,),
 (4.0,),
 (3.5,),
 (0.75,),
 (4.75,),
 (5.0,),
 (4.25,),
 (3.75,),
 (1.25,),
 (5.25,),
 (6.0,),
 (0.5,),
 (5.5,),
 (6.75,),
 (5.75,),
 (8.0,),
 (7.5,),
 (7.75,),
 (6.25,),
 (6.5,)]

In [43]:
%%sql
select distinct floors from house_price_data;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
6 rows affected.

[(1.0,), (2.0,), (1.5,), (3.0,), (2.5,), (3.5,)]

In [50]:
%%sql
select distinct house_price_data.condition from house_price_data;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
5 rows affected.

[(3,), (5,), (4,), (1,), (2,)]

In [48]:
%%sql
select distinct grade from house_price_data;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
11 rows affected.

[(7,), (6,), (8,), (11,), (9,), (5,), (10,), (12,), (4,), (3,), (13,)]

8.  Arrange the data in decreasing order by the price of the house. Return only the IDs of the top 10 most expensive houses in your data.

In [52]:
%%sql
select id from house_price_data
order by price desc
limit 10;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
10 rows affected.

[(6762700020,),
 (9808700762,),
 (9208900037,),
 (2470100110,),
 (8907500070,),
 (7558700030,),
 (1247600105,),
 (1924059029,),
 (7738500731,),
 (3835500195,)]

9.  What is the average price of all the properties in your data?

In [54]:
%%sql
select avg(price) as average_price from house_price_data;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
1 rows affected.

[(Decimal('540296.5735'),)]

10. In this exercise we will use a simple "group by" to check the properties of some of the categorical variables in our data

    - What is the average price of the houses grouped by bedrooms? The returned result should have only two columns, bedrooms and Average of the prices. Use an alias to change the name of the second column.
    - What is the average `sqft_living` of the houses grouped by bedrooms? The returned result should have only two columns, bedrooms and an average of the `sqft_living`. Use an alias to change the name of the second column.

In [58]:
%%sql
select count(id) as number_of_houses, bedrooms, avg(price) as average_price, avg(sqft_living) as average_sqft_living from house_price_data
group by bedrooms;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
12 rows affected.

[(9824, 3, Decimal('466276.5909'), Decimal('1805.8372')),
 (2760, 2, Decimal('401387.7471'), Decimal('1239.7529')),
 (6882, 4, Decimal('635564.6771'), Decimal('2554.6497')),
 (1601, 5, Decimal('786874.1262'), Decimal('3047.5453')),
 (196, 1, Decimal('318239.4592'), Decimal('888.1531')),
 (272, 6, Decimal('825853.5037'), Decimal('3284.3419')),
 (38, 7, Decimal('951447.8158'), Decimal('3974.2105')),
 (13, 8, Decimal('1105076.9231'), Decimal('3800.0000')),
 (6, 9, Decimal('893999.8333'), Decimal('3775.0000')),
 (1, 11, Decimal('520000.0000'), Decimal('3000.0000')),
 (3, 10, Decimal('820000.0000'), Decimal('3706.6667')),
 (1, 33, Decimal('640000.0000'), Decimal('1620.0000'))]

   - What is the average price of the houses with a waterfront and without a waterfront? The returned result should have only two columns, waterfront and `Average` of the prices. Use an alias to change the name of the second column.

In [61]:
%%sql
select count(id) as number_of_houses, waterfront, avg(price) as average_price from house_price_data
group by waterfront;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
2 rows affected.

[(21434, 0, Decimal('531762.3242')), (163, 1, Decimal('1662524.1840'))]

   - Is there any correlation between the columns `condition` and `grade`? You can analyze this by grouping the data by one of the variables and then aggregating the results of the other column. Visually check if there is a positive correlation or negative correlation or no correlation between the variables.

        You might also have to check the number of houses in each category (ie number of houses for a given `condition`) to assess if that category is well represented in the dataset to include it in your analysis. For eg. If the category is under-represented as compared to other categories, ignore that category in this analysis

In [71]:
%%sql
select count(id) as number_of_houses, house_price_data.condition, avg(price) as average_price from house_price_data
group by house_price_data.condition
order by house_price_data.condition;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
5 rows affected.

[(29, 1, Decimal('341067.2414')),
 (170, 2, Decimal('328178.7588')),
 (14020, 3, Decimal('542173.0573')),
 (5677, 4, Decimal('521374.4504')),
 (1701, 5, Decimal('612577.7425'))]

In [70]:
%%sql
select count(id) as number_of_houses, grade, avg(price) as average_price from house_price_data
group by grade
order by grade;

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
11 rows affected.

[(1, 3, Decimal('262000.0000')),
 (27, 4, Decimal('212001.8519')),
 (242, 5, Decimal('248523.9711')),
 (2038, 6, Decimal('301916.5707')),
 (8974, 7, Decimal('402594.5728')),
 (6065, 8, Decimal('542986.8000')),
 (2615, 9, Decimal('773738.2222')),
 (1134, 10, Decimal('1072347.4674')),
 (399, 11, Decimal('1497792.3784')),
 (89, 12, Decimal('2202528.0899')),
 (13, 13, Decimal('3710769.2308'))]

11. One of the customers is only interested in the following houses:

    - Number of bedrooms - either 3 or 4
    - Bathrooms - more than 3
    - One Floor
    - No waterfront
    - Condition should be 3 at least
    - Grade should be 5 at least
    - Price less than 300000

    For the rest of the things, they are not too concerned. Write a simple query to find what are the options available for them.

In [86]:
%%sql
select * from house_price_data
where (bedrooms between 3 and 4) and (bathrooms > 3) and (floors = 1) and (waterfront = 0) and (floors = 1) and (waterfront = 0) and (house_price_data.condition > 2) and (grade > 4) and (price < 300000);

   mysql+pymysql://root:***@localhost/bank
 * mysql+pymysql://root:***@localhost/house_price_regression
0 rows affected.

[]

In [89]:
# No options fulfill all these requirements

12. Your manager wants to find out the list of properties whose prices are twice more than the average of all the properties in the database. Write a query to show them the list of such properties. You might need to use a subquery for this problem.

13. Since this is something that the senior management is regularly interested in, create a view called `Houses_with_higher_than_double_average_price` of the same query.

14. Most customers are interested in properties with three or four bedrooms. What is the difference in average prices of the properties with three and four bedrooms? In this case, you can simply use a group by to check the prices for those particular houses.

15. What are the different locations where properties are available in your database? (distinct zip codes)

16. Show the list of all the properties that were renovated.

17. Provide the details of the property that is the 11th most expensive property in your database.